const obj2 = {
    "result": {
        "categories": {
            "Аксессуары": [
                "Рюкзаки",
                "Сумки",
                "Часы наручные"
            ],
            "Белье": [
                "Боди",
                "Бордшорты",
                "Бюстгальтеры",
                "Бюстье",
                "Колготки",
                "Лифы для купальника",
                "Монокини",
                "Носки",
                "Плавки",
                "Пояса для чулок",
                "Раздельные купальники",
                "Слитные купальники",
                "Трусы"
            ],
            "Белье для малышей": [
                "Носки для малышей"
            ],
            "Красота": [
                "Щетки косметические"
            ],
            "Одежда": [
                "Блузки",
                "Блузки-боди",
                "Бомберы",
                "Брюки",
                "Ветровки",
                "Водолазки",
                "Джеггинсы",
                "Джемперы",
                "Джинсы",
                "Жакеты",
                "Жилеты",
                "Капри",
                "Кардиганы",
                "Комбинезоны",
                "Костюмы",
                "Косухи",
                "Кофты",
                "Куртки",
                "Леггинсы",
                "Лонгсливы",
                "Ночные сорочки",
                "Пальто",
                "Парки",
                "Пиджаки",
                "Пижамы",
                "Платья",
                "Плащи",
                "Пуловеры",
                "Пуховики",
                "Рубашки",
                "Сарафаны",
                "Свитеры",
                "Свитшоты",
                "Толстовки",
                "Топы",
                "Туники",
                "Футболки",
                "Футболки-поло",
                "Халаты домашние",
                "Худи",
                "Шорты",
                "Юбки"
            ]
        }
    }
}

const array = []
const childrenArr = []
let currentMainId = 0
let currentChildrenId = 0


for (let keyCat in obj2.result.categories) {
    array.push({
        parent_value: currentMainId++, parent_label: keyCat, children: obj2.result.categories[keyCat].map((item) => {
            return { children: item, parent_key: currentMainId, children_value: currentChildrenId++ }
        })
    })
}

console.log("test-2", array);